In [1]:
import pandas as pd

In [4]:
# Series

s1 = pd.Series([1,2,3,4,5])
print(s1)
print(type(s1))

#index
print(s1[0])  ## label and index but diff is index --> pos and label --> named index

# Label

s2 = pd.Series([25,24,26,27], index=["bob", "EVE", "Tom", "Adam"])
print(s2)
print(type(s2))
print(s2["Tom"])  ##label
print(s2[2])   ## index

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
bob     25
EVE     24
Tom     26
Adam    27
dtype: int64
<class 'pandas.core.series.Series'>
26
26

C:\Users\Ainvio\AppData\Local\Temp\ipykernel_12812\3804708281.py:16: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s2[2])   ## index

In [10]:
# Series properties

#Homogenous
s3 = pd.Series([25,24,26,27,"Madu"], index=["bob", "EVE", "Tom", "Adam", 35])
print(s3)
print(type(s3))
print(s3.index)

#Vectorized Operation like numpy

#Handle Missing value with NaN
# Mutable Values, immutable Size
s1 = pd.Series([1,2,3,4,5])
s1[0] = 100
changed_s1= s1.drop(0)
print(s1)
print(changed_s1)

bob       25
EVE       24
Tom       26
Adam      27
35      Madu
dtype: object
<class 'pandas.core.series.Series'>
Index(['bob', 'EVE', 'Tom', 'Adam', 35], dtype='object')
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
# Dataframe -->> dictionary 
info = {
    "Name" : ["x", "y", "z"],
    "Age" : [12,32,13]
}
df = pd.DataFrame(info)
print(df, type(df))
print(df.index, df.columns)

  Name  Age
0    x   12
1    y   32
2    z   13 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1) Index(['Name', 'Age'], dtype='object')

In [14]:
# Dataframe -->> list and list
df = pd.DataFrame([["x", 15],["y", 14],["z", 45]], columns=["Name", "Age"])
print(df)

  Name  Age
0    x   15
1    y   14
2    z   45

In [16]:
## Numpy array to dataframe

import numpy as np
np_arr =  np.array([[1,2,3,4],[5,6,7,8]])
df = pd.DataFrame(np_arr, columns=["a", "b", "c", "d"])
print(df)

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

In [18]:
# csv data
df = pd.read_csv("employee_data.csv")
print(df)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [20]:
df = pd.read_json("https://lwfiles.mycourse.app/62a6cd5e1e9e2fbf212d608d-public/publicFiles/employee_data.json")
print(df)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [58]:
# DataFrame Methods
df.nunique()
print(df.head())
print(df.tail())
print(df.sample())
print(df.info())
print(df.shape)
print(df.describe())
print(df.columns)
print(df.nunique())

              Country              City  AQI Value AQI Category  CO AQI Value  \
0  Russian Federation        Praskoveya         51     Moderate             1
1              Brazil  Presidente Dutra         41         Good             1
2               Italy   Priolo Gargallo         66     Moderate             1
3              Poland         Przasnysz         34         Good             1
4              France          Punaauia         22         Good             0

  CO AQI Category  Ozone AQI Value Ozone AQI Category  NO2 AQI Value  \
0            Good               36               Good              0
1            Good                5               Good              1
2            Good               39               Good              2
3            Good               34               Good              0
4            Good               22               Good              0

  NO2 AQI Category  PM2.5 AQI Value PM2.5 AQI Category
0             Good               51           Moderate
1             Good               41               Good
2             Good               66           Moderate
3             Good               20               Good
4             Good                6               Good
                        Country          City  AQI Value AQI Category  \
23458                     India  Gursahaiganj        184    Unhealthy
23459                    France        Sceaux         50         Good
23460                     India      Mormugao         50         Good
23461  United States of America   Westerville         71     Moderate
23462                  Malaysia        Marang         70     Moderate

       CO AQI Value CO AQI Category  Ozone AQI Value Ozone AQI Category  \
23458             3            Good              154          Unhealthy
23459             1            Good               20               Good
23460             1            Good               22               Good
23461             1            Good               44               Good
23462             1            Good               38               Good

       NO2 AQI Value NO2 AQI Category  PM2.5 AQI Value PM2.5 AQI Category
23458              2             Good              184          Unhealthy
23459              5             Good               50               Good
23460              1             Good               50               Good
23461              2             Good               71           Moderate
23462              0             Good               70           Moderate
      Country      City  AQI Value AQI Category  CO AQI Value CO AQI Category  \
16377   Spain  Cardedeu         55     Moderate             1            Good

       Ozone AQI Value Ozone AQI Category  NO2 AQI Value NO2 AQI Category  \
16377               55           Moderate              1             Good

       PM2.5 AQI Value PM2.5 AQI Category
16377               50               Good
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23463 entries, 0 to 23462
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             23036 non-null  object
 1   City                23462 non-null  object
 2   AQI Value           23463 non-null  int64
 3   AQI Category        23463 non-null  object
 4   CO AQI Value        23463 non-null  int64
 5   CO AQI Category     23463 non-null  object
 6   Ozone AQI Value     23463 non-null  int64
 7   Ozone AQI Category  23463 non-null  object
 8   NO2 AQI Value       23463 non-null  int64
 9   NO2 AQI Category    23463 non-null  object
 10  PM2.5 AQI Value     23463 non-null  int64
 11  PM2.5 AQI Category  23463 non-null  object
dtypes: int64(5), object(7)
memory usage: 2.1+ MB
None
(23463, 12)
          AQI Value  CO AQI Value  Ozone AQI Value  NO2 AQI Value  \
count  23463.000000  23463.000000     23463.000000   23463.000000
mean      72.010868      1.368367        35.193709       3.063334
std       56.055220      1.832064        28.098723       5.254108
min        6.000000      0.000000         0.000000       0.000000
25%       39.000000      1.000000        21.000000       0.000000
50%       55.000000      1.000000        31.000000       1.000000
75%       79.000000      1.000000        40.000000       4.000000
max      500.000000    133.000000       235.000000      91.000000

       PM2.5 AQI Value
count     23463.000000
mean         68.519755
std          54.796443
min           0.000000
25%          35.000000
50%          54.000000
75%          79.000000
max         500.000000
Index(['Country', 'City', 'AQI Value', 'AQI Category', 'CO AQI Value',
       'CO AQI Category', 'Ozone AQI Value', 'Ozone AQI Category',
       'NO2 AQI Value', 'NO2 AQI Category', 'PM2.5 AQI Value',
       'PM2.5 AQI Category'],
      dtype='object')
Country                 175
City                  23462
AQI Value               347
AQI Category              6
CO AQI Value             34
CO AQI Category           3
Ozone AQI Value         213
Ozone AQI Category        5
NO2 AQI Value            59
NO2 AQI Category          2
PM2.5 AQI Value         383
PM2.5 AQI Category        6
dtype: int64

In [59]:
df = pd.read_csv("global air pollution dataset.csv")
df

,Country,City,AQI Value,AQI Category,CO AQI Value,CO AQI Category,Ozone AQI Value,Ozone AQI Category,NO2 AQI Value,NO2 AQI Category,PM2.5 AQI Value,PM2.5 AQI Category
0,Russian Federation,Praskoveya,51,Moderate,1,Good,36,Good,0,Good,51,Moderate
1,Brazil,Presidente Dutra,41,Good,1,Good,5,Good,1,Good,41,Good
2,Italy,Priolo Gargallo,66,Moderate,1,Good,39,Good,2,Good,66,Moderate
3,Poland,Przasnysz,34,Good,1,Good,34,Good,0,Good,20,Good
4,France,Punaauia,22,Good,0,Good,22,Good,0,Good,6,Good
...,...,...,...,...,...,...,...,...,...,...,...,...
23458,India,Gursahaiganj,184,Unhealthy,3,Good,154,Unhealthy,2,Good,184,Unhealthy
23459,France,Sceaux,50,Good,1,Good,20,Good,5,Good,50,Good
23460,India,Mormugao,50,Good,1,Good,22,Good,1,Good,50,Good
23461,United States of America,Westerville,71,Moderate,1,Good,44,Good,2,Good,71,Moderate
23462,Malaysia,Marang,70,Moderate,1,Good,38,Good,0,Good,70,Moderate

In [40]:
# indexing and selecting data
df["City"]


# rows
df.loc[2]
df.loc[0:2]  #start idx: end idx (inclusive)

df.iloc[2]
df.iloc[0:3] #start idx: end idx (exclusive)

# cells - row, col
df.loc[0:2, ["City", "Country"]]  # row and label
df.iloc[0:2, 2]    #iloc numeric value pass korte hobe even column numeric value

#only cell
df.at[0,"City"]
df.iat[0, 1]

'Praskoveya'

In [51]:
# Filtering data

aqi_data = df[ (df["AQI Value"] > 20) & (df["PM2.5 AQI Category"]=="Good")] [[ "City", "AQI Value"]]
aqi_data.iloc[2]   ## filter data 2 no index value exist
#aqi_data.loc[2]  ## 2 label er kono data fiter a nei

City         Punaauia
AQI Value          22
Name: 4, dtype: object

In [57]:
# Query filter--> copy return not view

aqi_val = 100
aqi_val = 100

df.query("`AQI Value` > @aqi_val and `PM2.5 AQI Category` == 'Good'")[["City", "AQI Value"]]

             City  AQI Value
9838  Palm Valley        125

In [64]:
# Cleaning Data
df = pd.read_csv("raw_data.csv") 

# Handle Missing values
df.isnull()            # True for null values (NaN)
df.isnull().sum()      # counts missing vals per column

df.dropna()            # drops rows with missing values
df.dropna(axis = 1)    # drops cols with missing values

df.fillna(0)           # fills NaN with value
df["age"] = df["age"].fillna(df["age"].mean())           # fills column with mean

df.ffill()             # forward fill
df.bfill()             # backward fill

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  51000.0
5    5        Li Wei  27.00   China     Male  51000.0
6    6    Ahmed Khan  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     USA     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [63]:
df

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [65]:
# Handle Duplicate values
df = pd.read_csv("raw_data.csv") 

df.duplicated()                      # True for duplicate rows
df.duplicated("country")             # True for duplicate rows in particular col
df.duplicated(["country", "gender"]) 

df.drop_duplicates()                  # drops duplicate rows

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [66]:
# Handle Data Types
df = pd.read_csv("raw_data.csv") 

df.dtypes                                     # dtype of each col
df2 = df.fillna(0).copy()
df2["income"] = df2["income"].astype(int)       # change dtype

# String type
df2["gender"].str.lower()                      # lower case
df2["gender"].str.upper()                      # upper case
df2["gender"].str.capitalize()                 # capitalize

df2["gender"].str.capitalize()                 # capitalize
df2["name"].str.split(" ")                     # splits into lists based on separator value 
type(df2["name"].str.split(" ")[0])            

df2["country"].str.contains("US")
df2["country"].str.contains("india", case=False)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object

In [12]:
df = pd.read_csv("raw_data.csv") 

###Feature Engineering

df2 = df.copy()
df2["tax"] = df2["income"].apply(lambda x : "20%" if x >= 60000 else "10%")  ## apply function higher order because another func is a parameter in this func

## Map
gender_mp = {"Male": "M", "Female":"F", "Unknown": "U"}
df2["gender"] = df2["gender"].map(gender_mp)

#Assign func income increase 10%
df2 = df2.assign(new_income = df2["income"] * 1.1)

df2["country"] = df2["country"].replace("USA" , "US")
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0      US      M  55000.0  10%     60500.0
1    1      John Doe  29.0      US      M  55000.0  10%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN      US      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0

In [27]:
### Others Transformation Methods

df2.columns = ["Id","Name","Age", "Country", "Gender", "Income","Tax", "New_Income"]
df2.rename(columns={"Income":"Salary"})
df2.rename(index={1: "First"})

df2.sort_values("Income")
#f2.sort_values("Income", ascending=False)
sorted_df = df2.sort_values(["Income", "Age"])

sorted_df.sort_index()
sorted_df.reset_index(drop=True)

#Ranking 
sorted_df["Ranking"] = sorted_df["Income"].rank(ascending=False, method="dense")
sorted_df

#Reorder columns
sorted_df[["Id","Name","Age", "Country", "Gender", "Income", "New_Income", "Tax"]]

    Id          Name   Age Country Gender   Income  Tax  New_Income  Ranking
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0      8.0
3    3          Alex   NaN      US      U  47000.0  10%     51700.0      7.0
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0      6.0
0    1      John Doe  29.0      US      M  55000.0  10%     60500.0      5.0
1    1      John Doe  29.0      US      M  55000.0  10%     60500.0      5.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0      4.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0      3.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0      3.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0      2.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0      1.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN      NaN

In [1]:
#### shift 1 id column in the last with list comp

df2 = df.copy()

new_col_order = [col for col in df.columns if col != "id"] + ["id"]
print(new_col_order)
df2[new_col_order]

NameError: name 'df' is not defined

In [30]:
df2 = df.copy()

df2 = df2.drop_duplicates()
df2 = df2.fillna(0)
df2 = df2.sort_values("income")

df2 = df2.reset_index(drop=True)

df2.to_csv("sorted_data.csv")

In [36]:
### Group by and Aggregation

df.groupby("country")["income"].mean()
df.groupby("country")["income"].max()
df.groupby("country")["income"].min()

df.groupby("country")["income"].agg(["mean","min", "max"])
df.groupby("country")["income"].aggregate(["mean","min", "max"])

df.groupby("country")["income"].agg(avg_salary="mean", min_salary="min", max_salary = "max")

df.groupby("country").agg({
    "income": "mean",
    "age": "mean"
})

df.groupby("country").agg(
   max_salary=( "income", "max"),
    avg_age = ("age", "mean")
)

         max_salary  avg_age
country
Canada      62000.0      NaN
China       51000.0     27.0
India       73000.0     45.0
Mexico      45000.0      NaN
Spain           NaN     34.0
USA         62000.0     29.5

In [44]:
# Melt and Pivot for Reshaping

df = pd.DataFrame({
    "country" : ["USA", "USA", "Bangladesh", "Bangladesh"],
    "year" : [2020, 2021, 2020, 2021],
    "sales" : [100, 120, 90, 110],
    "profit": [20,25,18,22],
})

df

melted_df = df.melt(
    id_vars = ["country", "year"],
    value_vars = ["sales", "profit"],
    var_name = "metrics",
    value_name = "value"
)

melted_df

original = melted_df.pivot(
    index = ["country", "year"],
    columns = "metrics",
    values = "value"
)
original

metrics          profit  sales
country    year
Bangladesh 2020      18     90
           2021      22    110
USA        2020      20    100
           2021      25    120

In [48]:
# Merging & Joining

df_customers= pd.DataFrame({ 
    "customer_id": [1,2,3,4],
    "name":["Adam","Bob","Charlie","Dave"]
}) 
df_orders= pd.DataFrame({ 
    "order_id": [101,102,103,104],
    "customer_id":[2,1,4,5],
    "amount":[250,120,300,180]
})

pd.merge(df_customers, df_orders, on ="customer_id") ### Inner join
pd.merge(df_customers, df_orders, on ="customer_id", how = "left") ## Left join
pd.merge(df_customers, df_orders, on ="customer_id", how = "right") ## right join
pd.merge(df_customers, df_orders, on ="customer_id", how = "outer")  ## Outer Join

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0
4            5      NaN     104.0   180.0

In [52]:
# Data Concatenation

df1= pd.DataFrame({ 
    "id": [1,2,3],"name":["Adam","Bob","Charlie"]
}) 
df2= pd.DataFrame({ 
    "id": [4,5,6],"name":["David","Eva","Frank"]
})

pd.concat([df1, df2], ignore_index=True)

pd.concat([df1, df2], axis=1)

   id     name  id   name
0   1     Adam   4  David
1   2      Bob   5    Eva
2   3  Charlie   6  Frank